mediaMicroservices/wrk2/outs/c500_r500.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 500 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 10000.676ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 10001.314ms, rate sampling interval: 20021ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    38.41s    13.99s    0.92m    71.25%
    Req/Sec    22.24     59.56   300.00     84.29%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   44.66s 
 75.000%   49.18s 
 90.000%    0.86m 
 99.000%    0.92m 
 99.900%    0.93m 
 99.990%    0.95m 
 99.999%    0.95m 
100.000%    0.95m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000          388         1.00
   10010.623     0.100000          474         1.11
   21463.039     0.200000          907         1.25
   31260.671     0.300000         1358         1.43
   40730.623     0.400000         1811         1.67
   44662.783     0.500000         2266         2.00
   45907.967     0.550000         2490         2.22
   46891.007     0.600000         2726         2.50
   47677.439     0.650000         2944         2.86
   48463.871     0.700000         3171         3.33
   49184.767     0.750000         3395         4.00
   49577.983     0.775000         3515         4.44
   49905.663     0.800000         3621         5.00
   50298.879     0.825000         3740         5.71
   50692.095     0.850000         3852         6.67
   51118.079     0.875000         3961         8.00
   51445.759     0.887500         4020         8.89
   51707.903     0.900000         4075        10.00
   52068.351     0.912500         4134        11.43
   52363.263     0.925000         4188        13.33
   52723.711     0.937500         4244        16.00
   52953.087     0.943750         4274        17.78
   53149.695     0.950000         4305        20.00
   53411.839     0.956250         4329        22.86
   53673.983     0.962500         4357        26.67
   53968.895     0.968750         4389        32.00
   54034.431     0.971875         4400        35.56
   54099.967     0.975000         4417        40.00
   54263.807     0.978125         4430        45.71
   54427.647     0.981250         4446        53.33
   54591.487     0.984375         4457        64.00
   54689.791     0.985938         4463        71.11
   54788.095     0.987500         4470        80.00
   54984.703     0.989062         4477        91.43
   55148.543     0.990625         4484       106.67
   55214.079     0.992188         4494       128.00
   55246.847     0.992969         4496       142.22
   55279.615     0.993750         4498       160.00
   55345.151     0.994531         4502       182.86
   55443.455     0.995313         4507       213.33
   55508.991     0.996094         4511       256.00
   55508.991     0.996484         4511       284.44
   55607.295     0.996875         4512       320.00
   55738.367     0.997266         4514       365.71
   55803.903     0.997656         4516       426.67
   55934.975     0.998047         4518       512.00
   56000.511     0.998242         4519       568.89
   56000.511     0.998437         4519       640.00
   56033.279     0.998633         4520       731.43
   56098.815     0.998828         4521       853.33
   56164.351     0.999023         4522      1024.00
   56426.495     0.999121         4523      1137.78
   56426.495     0.999219         4523      1280.00
   56426.495     0.999316         4523      1462.86
   56754.175     0.999414         4525      1706.67
   56754.175     0.999512         4525      2048.00
   56754.175     0.999561         4525      2275.56
   56754.175     0.999609         4525      2560.00
   56754.175     0.999658         4525      2925.71
   56754.175     0.999707         4525      3413.33
   56754.175     0.999756         4525      4096.00
   56786.943     0.999780         4526      4551.11
   56786.943     1.000000         4526          inf
#[Mean    =    38409.134, StdDeviation   =    13990.881]
#[Max     =    56754.176, Total count    =         4526]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4556 requests in 1.00m, 1.21MB read
  Socket errors: connect 0, read 0, write 0, timeout 1947
  Non-2xx or 3xx responses: 2494
Requests/sec:     75.96
Transfer/sec:     20.68KB