mediaMicroservices/wrk2/outs/c50_r10.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 50 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
[...]
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    21.34s    10.69s   47.19s    47.93%
    Req/Sec     0.89      9.60     0.00     99.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   20.69s 
 75.000%   29.23s 
 90.000%   36.01s 
 99.000%   47.19s 
 99.900%    0.85m 
 99.990%    0.85m 
 99.999%    0.85m 
100.000%    0.85m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000           33         1.00
   10002.431     0.100000           33         1.11
   10010.623     0.200000           58         1.25
   10010.623     0.300000           58         1.43
   16580.607     0.400000           68         1.67
   20692.991     0.500000           85         2.00
   21151.743     0.550000           93         2.22
   23445.503     0.600000          102         2.50
   24625.151     0.650000          110         2.86
   27639.807     0.700000          119         3.33
   29229.055     0.750000          127         4.00
   30097.407     0.775000          131         4.44
   31670.271     0.800000          136         5.00
   32243.711     0.825000          140         5.71
   33144.831     0.850000          144         6.67
   35192.831     0.875000          148         8.00
   35749.887     0.887500          150         8.89
   36044.799     0.900000          153        10.00
   36995.071     0.912500          155        11.43
   37879.807     0.925000          157        13.33
   38928.383     0.937500          160        16.00
   38928.383     0.943750          160        17.78
   41091.071     0.950000          161        20.00
   41680.895     0.956250          162        22.86
   43614.207     0.962500          163        26.67
   43843.583     0.968750          164        32.00
   44204.031     0.971875          165        35.56
   44204.031     0.975000          165        40.00
   44236.799     0.978125          166        45.71
   44236.799     0.981250          166        53.33
   47185.919     0.984375          167        64.00
   47185.919     0.985938          167        71.11
   47185.919     0.987500          167        80.00
   49381.375     0.989062          168        91.43
   49381.375     0.990625          168       106.67
   49381.375     0.992188          168       128.00
   49381.375     0.992969          168       142.22
   49381.375     0.993750          168       160.00
   51150.847     0.994531          169       182.86
   51150.847     1.000000          169          inf
#[Mean    =    21338.076, StdDeviation   =    10685.886]
#[Max     =    51118.080, Total count    =          169]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  169 requests in 1.00m, 58.92KB read
  Socket errors: connect 0, read 0, write 0, timeout 997
  Non-2xx or 3xx responses: 169
Requests/sec:      2.82
Transfer/sec:      0.98KB