mediaMicroservices/wrk2/outs/c50_r1000.out
Running 1m test @ http://10.100.189.154:8080/wrk2-api/review/compose
  4 threads and 50 connections
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9223372036854776.000ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 9998.336ms, rate sampling interval: 20004ms
  Thread calibration: mean lat.: 10006.528ms, rate sampling interval: 20021ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    30.18s    14.09s   50.27s    60.50%
    Req/Sec     1.28     14.97     0.00     99.09%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   30.03s 
 75.000%   40.11s 
 90.000%   50.04s 
 99.000%   50.27s 
 99.900%   50.50s 
 99.990%   50.50s 
 99.999%   50.50s 
100.000%   50.50s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

   10002.431     0.000000           40         1.00
   10002.431     0.100000           40         1.11
   19873.791     0.200000           48         1.25
   20021.247     0.300000           74         1.43
   29868.031     0.400000           98         1.67
   30031.871     0.500000          121         2.00
   30081.023     0.550000          133         2.22
   39649.279     0.600000          143         2.50
   39944.191     0.650000          155         2.86
   40042.495     0.700000          169         3.33
   40108.031     0.750000          183         4.00
   40140.799     0.775000          185         4.44
   49643.519     0.800000          191         5.00
   49905.663     0.825000          198         5.71
   49971.199     0.850000          205         6.67
   50003.967     0.875000          211         8.00
   50036.735     0.887500          217         8.89
   50036.735     0.900000          217        10.00
   50069.503     0.912500          222        11.43
   50069.503     0.925000          222        13.33
   50102.271     0.937500          226        16.00
   50102.271     0.943750          226        17.78
   50135.039     0.950000          231        20.00
   50135.039     0.956250          231        22.86
   50135.039     0.962500          231        26.67
   50135.039     0.968750          231        32.00
   50167.807     0.971875          234        35.56
   50167.807     0.975000          234        40.00
   50167.807     0.978125          234        45.71
   50167.807     0.981250          234        53.33
   50233.343     0.984375          235        64.00
   50233.343     0.985938          235        71.11
   50266.111     0.987500          236        80.00
   50266.111     0.989062          236        91.43
   50266.111     0.990625          236       106.67
   50429.951     0.992188          237       128.00
   50429.951     0.992969          237       142.22
   50429.951     0.993750          237       160.00
   50429.951     0.994531          237       182.86
   50429.951     0.995313          237       213.33
   50495.487     0.996094          238       256.00
   50495.487     1.000000          238          inf
#[Mean    =    30178.605, StdDeviation   =    14089.699]
#[Max     =    50462.720, Total count    =          238]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  240 requests in 1.00m, 83.67KB read
  Non-2xx or 3xx responses: 240
Requests/sec:      4.00
Transfer/sec:      1.39KB